Enums/ИА_БПВариантыДней.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ИА_БПВариантыДней</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Календарные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Рабочие</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ИА_БПТипыТочекМаршрута.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ИА_БПТипыТочекМаршрута</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Старт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Завершение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Действие</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Разделение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Слияние</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Условие</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВложенныйБизнесПроцесс</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыборВарианта</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ИА_БПСобытияТочекБП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ИА_БПСобытияТочекБП</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Условие_ПроверкаУсловия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Действие_ПриВыполнении</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФормированиеНаименования</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФормированиеСодержания</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УстановкаОтветственного</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ИА_БПВариантыОбработчиков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ИА_БПВариантыОбработчиков</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Нет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Интерактивно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КонструкторУсловия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрограммныйОбработчик</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ИА_БПМаршрутЗадач.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ИА_БПМаршрутЗадач</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТекущаяКартаМаршрута</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИА_БПКартыМаршрутов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьВладельцаБПВЗадаче</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДоступныеВладельцы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1024</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ИА_БПТочкиМаршрута.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ИА_БПТочкиМаршрута</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.ИА_БПКартыМаршрутов</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИА_БПТипыТочекМаршрута</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПорядокВКарте</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИА_БПТипыАдресацииЗадач</v8:Type>
						<v8:Type>cfg:CatalogRef.ОргСхема</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантДлительности</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИА_БПВариантыДней</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДлительностьВыполнения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрограммнаяОбработка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛинияДляУсловияИстинно</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИА_БПВариантыУсловийТочекМаршрута</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛинияДляУсловияЛожно</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИА_БПВариантыУсловийТочекМаршрута</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоУведомление</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаршрутЗадачВложенногоБП</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИА_БПМаршрутЗадач</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЗадачи</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИА_БПТипыЗадач</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВозвращатьАвторуНаПроверку</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ИсходящиеЛинии</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Адрес</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИА_БПТочкиМаршрута</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Идентификатор</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>256</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>256</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вариант</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИА_БПВариантыУсловийТочекМаршрута</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Обработчики</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Событие</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ИА_БПСобытияТочекБП</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Обработчик</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ИА_БПВариантыОбработчиков</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Код</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХранилищеДанных</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>РеквизитыВложенногоБП</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Реквизит</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ИА_БПРеквизиты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СпособЗаполнения</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ИА_БПСпособыЗаполненияДопРеквизитов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ИА_БПРеквизиты</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХранилищеДанных</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ВыводимыеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Реквизит</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ИА_БПРеквизиты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОчищатьПриСозданииЗадачи</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КонтролироватьЗаполнение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТолькоПросмотр</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/ИА_БПС/Ext/Module.bsl
Функция ОбщиеНастройкиБП() Экспорт
	Результат = Новый Структура;
    Результат.Вставить("КСУ",                       Ложь);
    Результат.Вставить("ТипыЗадач",                 Истина);
    Результат.Вставить("ДлительностьЗадач",         Истина);
    Результат.Вставить("ЭтоАдмин",                  РольДоступна("ПолныеПрава"));
    
    ИА_БПСПереопределяемый.ЗаполнитьОбщиеНастройкиБП(Результат);
    
    Возврат Результат;
КонецФункции
 

Процедура Обработчик_БП_ПередСтартом(Объект, Отказ) Экспорт
    Если НЕ ЗначениеЗаполнено(Объект.ИА_КартаМаршрутаБП)
        ИЛИ Объект.ИА_КартаМаршрутаБП.Карта.Получить() = Неопределено
        Тогда
    	Сообщение = Новый СообщениеПользователю;
        Сообщение.Текст = "Не задана карта маршрута БП, старт невозможен !";
        Сообщение.Сообщить();
        Отказ = Истина
    КонецЕсли;
    
    Менеджер = Обработки.ИА_БПМенеджер.Создать();
    Менеджер.Инициализировать(Объект.Ссылка, , Объект);
    Менеджер.БП_Старт(Отказ);
КонецПроцедуры

Функция ДобавитьКДате(Дата, Вариант, КоличествоДней) Экспорт
    Контекст = Новый Структура("Дата, Вариант, КоличествоДней"
    , Дата, Вариант, КоличествоДней);
    Результат = ИА_БПСПереопределяемый.ДобавитьКДате(Контекст);
    Если Результат <> Неопределено Тогда
    	Возврат Результат;
    КонецЕсли; 
    
    Если      Вариант = Перечисления.ИА_БПВариантыДней.Календарные Тогда
    	Результат = Дата + КоличествоДней * 86400;
    ИначеЕсли Вариант = Перечисления.ИА_БПВариантыДней.Рабочие Тогда
        
        СчетчикДат  = НачалоДня(Дата);
        СчетчикДней = 0;
        
        Пока СчетчикДней < Окр(КоличествоДней, 0) Цикл
            СчетчикДат  = СчетчикДат  + 86400;
            Если ДеньНедели(СчетчикДат) < 6 Тогда
                СчетчикДней = СчетчикДней + 1;	
            КонецЕсли; 
        КонецЦикла; 
        
        Результат = СчетчикДат;
    Иначе
        Результат = '00010101';
    КонецЕсли; 
    Возврат Результат;
КонецФункции

Функция ПолучитьИмяЗадачи() Экспорт
	Результат = Метаданные.БизнесПроцессы.ИА_БПНоситель.Задача.Имя;
	Возврат Результат;
КонецФункции

Функция ПолучитьИмяРеквизитаАдресацииИсполнителя() Экспорт
    Результат = ИА_БПСПереопределяемый.ПолучитьИмяРеквизитаАдресацииИсполнителя();
    Если НЕ ЗначениеЗаполнено(Результат) Тогда
        Результат = "Пользователь";	
    КонецЕсли; 
    Возврат Результат;
КонецФункции
 
Функция ПолучитьИнформациюОЗадачахПоИмениТочки(БП, ИмяТочки, ВключатьИсключенные = Ложь) Экспорт
    Обр = Обработки.ИА_БПМенеджер.СоздатьПоБизнесПроцессу(БП);
	Точка = Обр.Точки_ПолучитьПоИмениТочки(ИмяТочки);
    Таб = Обр.Задачи_ПолучитьЗадачиПоИмениТочки(ИмяТочки);
    
    ВложенныеБП = Новый Массив;
    ТипТочки = Обр.Точки_ПолучитьИнформацию(Точка).Тип;
    Если ТипТочки = Перечисления.ИА_БПТипыТочекМаршрута.ВложенныйБизнесПроцесс Тогда
        Для каждого Стр Из Таб Цикл
        	ВложенныеБП.Добавить(ИА_БПС.ПолучитьПодчиненныйБП(Стр.Ссылка));
        КонецЦикла;  
    КонецЕсли; 
    
    Результат = Новый Структура("СписокЗадач, Точка, Тип, ВложенныеБП"
    , Таб.ВыгрузитьКолонку("Ссылка")
    , Точка
    , ТипТочки
    , ВложенныеБП);
    Возврат Результат;
КонецФункции

Процедура СообщениеВЖурнал(ИмяСобытия, ТекстСообщения, Уровень=Неопределено) Экспорт
    Если Уровень = Неопределено Тогда
    	Уровень = УровеньЖурналаРегистрации.Ошибка;
    КонецЕсли; 		
    
    ЗаписьЖурналаРегистрации("БП." + ИмяСобытия, Уровень,,, ТекстСообщения);
КонецПроцедуры

Функция СформироватьТаблицуПеременных(МаршрутЗадач) Экспорт
    ДЗ = Новый ДеревоЗначений;
    ДЗ.Колонки.Добавить("Представление");
    ДЗ.Колонки.Добавить("ПутьДанных");
    ДЗ.Колонки.Добавить("ОписаниеТипа");
    ДЗ.Колонки.Добавить("Данные");
    ДЗ.Колонки.Добавить("Вид");
    
    Стр = ДЗ.Строки.Добавить();
    Стр.Представление   = "БизнесПроцесс";
    Стр.ПутьДанных      = "Контекст.БП";
    Стр.ОписаниеТипа    = Новый ОписаниеТипов("БизнесПроцессСсылка.ИА_БПНоситель");
    Стр.Строки.Добавить().Представление = "стаб";
    
    Стр = ДЗ.Строки.Добавить();
    Стр.Представление   = "Задача";
    Стр.ПутьДанных      = "Контекст.Задача";
    Стр.ОписаниеТипа    = Новый ОписаниеТипов("ЗадачаСсылка." + ИА_БПС.ПолучитьИмяЗадачи());
    Стр.Строки.Добавить().Представление = "стаб";
    
    Ветка = ДЗ.Строки.Добавить();
    Ветка.Представление = "Доп. реквизиты";
    Ветка.Вид = 1;
    
    Таб = Справочники.ИА_БПМаршрутЗадач.ПолучитьТаблицуДопРеквизитов(МаршрутЗадач);
    Для каждого стр Из Таб Цикл
        ДочВетка = Ветка.Строки.Добавить();
        ДочВетка.Представление   = Стр.Наименование;
        ДочВетка.ПутьДанных      = "Контекст.ДопРеквизиты[""" + Стр.Реквизит.УникальныйИдентификатор() + """]";
        ДочВетка.ОписаниеТипа    = Стр.Реквизит.ТипЗначения;
        
        Таб  = ИА_БФС.Типы_ОписаниеТипов2ТаблицаСтроковыхТипов(Стр.Реквизит.ТипЗначения);
        ЭтоСсылочныйТип = ИА_БФС.ТЗ_ФильтрПоОтбору(Таб, Новый Структура("Ссылочный", Истина)).Количество() > 0;
        Если ЭтоСсылочныйТип Тогда
            ДочВетка.Строки.Добавить().Представление = "стаб";
        КонецЕсли; 
    КонецЦикла; 
    
    Переменные = ИА_БФС.ДЗ2ДЗФ(ДЗ);
    Возврат Переменные;
КонецФункции

Функция СформироватьКонтекстВыполненияДляЗадачи(Задача) Экспорт
    #ЕСЛИ НЕ( Клиент или Сервер или ВнешнееСоединение ) Тогда
        Задача = задачи.ИА_БПЗадачаНосителя.СоздатьЗадачу();
    #КОНЕЦЕСЛИ
    БизнесПроцесс  = Задача.БизнесПроцесс;
    
    Контекст = Новый Структура;
    Контекст.Вставить("БП", БизнесПроцесс);
    Контекст.Вставить("Задача", Задача);
    
    ТабДР = Справочники.ИА_БПМаршрутЗадач.ПолучитьТаблицуДопРеквизитов(БизнесПроцесс.ИА_МаршрутЗадачБП);
    ТабРеквизитов = Новый Массив;
    
    ДопРеквизиты = Новый Соответствие;
    Для каждого стр Из ТабДР Цикл
        НайдСтрока = БизнесПроцесс.ИА_Реквизиты.Найти(Стр.Реквизит, "Реквизит");
        
        Если НайдСтрока <> Неопределено Тогда
            Значение = НайдСтрока.Значение;
        Иначе
            Значение = Стр.Реквизит.ЗначениеПоУмолчанию;
        КонецЕсли; 
        ДопРеквизиты.Вставить(""+Стр.Реквизит.УникальныйИдентификатор(), Значение);
        
        ТабРеквизитов.Добавить(Новый Структура("Реквизит, Значение", Стр.Реквизит, Значение));
    КонецЦикла; 
    
    Контекст.Вставить("ДопРеквизиты", ДопРеквизиты);
    Контекст.Вставить("ТабРеквизиты", ТабРеквизитов);
    
    Возврат Контекст;
КонецФункции

Функция ПолучитьСписокПодчиненныхБП(ВедущаяЗадача, ТолькоНезавершенные = Ложь) Экспорт
    Таб = ИА_БФС.Запрос_ВыполнитьВТЗ(
    //#Область ТекстЗапроса
    "ВЫБРАТЬ  разрешенные
    |   ИА_БПНоситель.Ссылка
    |ИЗ
    |   БизнесПроцесс.ИА_БПНоситель КАК ИА_БПНоситель
    |ГДЕ
    |   ИА_БПНоситель.ВедущаяЗадача = &ВедущаяЗадача
    |   И НЕ ИА_БПНоситель.ПометкаУдаления
    |   И ИА_БПНоситель.Стартован
    |   И (НЕ &ТолькоНезавершенные
    |           ИЛИ НЕ ИА_БПНоситель.Завершен)"
    //#КонецОбласти 
    , Новый Структура("ВедущаяЗадача, ТолькоНезавершенные", ВедущаяЗадача, ТолькоНезавершенные)); 
    
    Результат = Таб.ВыгрузитьКолонку("Ссылка");
    Возврат Результат
КонецФункции

Функция ПолучитьРодительскиеБП(БП) Экспорт
	#ЕСЛИ НЕ( Клиент или Сервер или ВнешнееСоединение ) Тогда
        БП = БизнесПроцессы.ИА_БПНоситель.ПустаяСсылка();
    #КОНЕЦЕСЛИ
    
    Результат = Новый Массив;
    Если ЗначениеЗаполнено(БП) Тогда
        ТекЗадача = БП.ВедущаяЗадача;
        Пока ЗначениеЗаполнено(ТекЗадача) Цикл
            ИА_БФКС.Массив_ДобавитьЕслиНет(Результат, ТекЗадача.БизнесПроцесс);
            ТекЗадача = ТекЗадача.БизнесПроцесс.ВедущаяЗадача;
        КонецЦикла;     
    КонецЕсли; 
    
    Возврат Результат;
КонецФункции

Функция ПолучитьПодчиненныйБП(ВедущаяЗадача) Экспорт
    #ЕСЛИ НЕ( Клиент или Сервер или ВнешнееСоединение ) Тогда
        ВедущаяЗадача = Задачи.ИА_БПЗадачаНосителя.ПустаяСсылка();
    #КОНЕЦЕСЛИ
    Результат = БизнесПроцессы.ИА_БПНоситель.ПустаяСсылка();
    Если ВедущаяЗадача.ИА_ТочкаБП.Тип = Перечисления.ИА_БПТипыТочекМаршрута.ВложенныйБизнесПроцесс
        И ЗначениеЗаполнено(ВедущаяЗадача)
        Тогда
        Результат = ИА_БФС.Запрос_ВыполнитьСкалярный(
        "ВЫБРАТЬ  разрешенные
        |   ИА_БПНоситель.Ссылка Результат
        |ИЗ
        |   БизнесПроцесс.ИА_БПНоситель КАК ИА_БПНоситель
        |ГДЕ
        |   НЕ ИА_БПНоситель.ПометкаУдаления
        |   И ИА_БПНоситель.ВедущаяЗадача = &ВедущаяЗадача"
        , Новый Структура("ВедущаяЗадача", ВедущаяЗадача));
    КонецЕсли; 
    Возврат Результат;
КонецФункции

Функция ПроверкаФормулыДляУстановкиОтветственного(Формула) Экспорт
    Отказ = Ложь;
    Если Формула.СоставФормулы.Количество() <> 1 Тогда        
    	ИА_БФКС.СообщениеОбОшибке("Формула должна содержать одно поле", Отказ); 
    Иначе
        Стр = Формула.СоставФормулы[0];
        Попытка
            Отказ = НЕ Стр.ОписаниеТипа.СодержитТип(Тип("СправочникСсылка.Пользователи"));
            ЕстьОргСхема = Метаданные.Справочники.Найти("ОргСхема") <> Неопределено;
            Если Отказ И ЕстьОргСхема Тогда
                Отказ = НЕ Стр.ОписаниеТипа.СодержитТип(Тип("СправочникСсылка.ОргСхема"));
            КонецЕсли; 
            
            Если Отказ Тогда
            	ИА_БФКС.СообщениеОбОшибке("Формула должна содержать ссылку на справочник пользователей "
                + ?(ЕстьОргСхема, " или на орг.схему","") + "!"); 
            КонецЕсли; 
        Исключение
            ТекстОшибки = ОписаниеОшибки();
            ИА_БФКС.СообщениеОбОшибке("Состав формулы не содержит описания типов! " + ТекстОшибки, Отказ); 
        КонецПопытки; 
    КонецЕсли;
    
    Возврат НЕ Отказ;
КонецФункции

Функция ПроверкаФормулыДляУстановкиЗначенияРеквизита(Формула) Экспорт
    Отказ = Ложь;
    Возврат НЕ Отказ;
КонецФункции

//_____________________________________________________________
// Работа с файлами

Функция Файлы_КаталогХранения() Экспорт
	Каталог = Константы.ИА_КаталогХраненияФайлов.Получить();
    Если ЗначениеЗаполнено(Каталог) И Прав(Каталог, 1) <> "\" Тогда
    	Каталог = Каталог + "\";
    КонецЕсли; 
    Возврат Каталог;
КонецФункции
 


//_____________________________________________________________
// Обработчики

Функция   Обработчики_ПолучитьСписокДоступныхВариантовДляТипаТочки(Тип, Событие = Неопределено) Экспорт
    #ЕСЛИ НЕ( Клиент или Сервер или ВнешнееСоединение ) Тогда
        Тип = Перечисления.ИА_БПТипыТочекМаршрута.ПустаяСсылка();
    #КОНЕЦЕСЛИ
    Результат = Новый Массив;
    
    Если Тип = Перечисления.ИА_БПТипыТочекМаршрута.Условие Тогда
        Если Событие = Перечисления.ИА_БПСобытияТочекБП.Условие_ПроверкаУсловия Тогда
            Результат.Добавить(Перечисления.ИА_БПВариантыОбработчиков.Интерактивно);
            Результат.Добавить(Перечисления.ИА_БПВариантыОбработчиков.КонструкторУсловия);
            Результат.Добавить(Перечисления.ИА_БПВариантыОбработчиков.ПрограммныйОбработчик);
        ИначеЕсли Событие = Перечисления.ИА_БПСобытияТочекБП.ФормированиеНаименования
            ИЛИ Событие = Перечисления.ИА_БПСобытияТочекБП.ФормированиеСодержания
			ИЛИ Событие = Перечисления.ИА_БПСобытияТочекБП.УстановкаОтветственного
            Тогда
            Результат.Добавить(Перечисления.ИА_БПВариантыОбработчиков.Нет);
            Результат.Добавить(Перечисления.ИА_БПВариантыОбработчиков.КонструкторУсловия);
            Результат.Добавить(Перечисления.ИА_БПВариантыОбработчиков.ПрограммныйОбработчик);
        КонецЕсли; 
    ИначеЕсли Тип = Перечисления.ИА_БПТипыТочекМаршрута.Действие
        ИЛИ Тип = Перечисления.ИА_БПТипыТочекМаршрута.ВложенныйБизнесПроцесс
        Тогда
        Если Событие = Перечисления.ИА_БПСобытияТочекБП.Действие_ПриВыполнении
            ИЛИ Событие = Перечисления.ИА_БПСобытияТочекБП.ФормированиеНаименования
            ИЛИ Событие = Перечисления.ИА_БПСобытияТочекБП.ФормированиеСодержания
            ИЛИ Событие = Перечисления.ИА_БПСобытияТочекБП.УстановкаОтветственного
            Тогда
            Результат.Добавить(Перечисления.ИА_БПВариантыОбработчиков.Нет);
            Результат.Добавить(Перечисления.ИА_БПВариантыОбработчиков.КонструкторУсловия);
            Результат.Добавить(Перечисления.ИА_БПВариантыОбработчиков.ПрограммныйОбработчик);
        КонецЕсли;
    //ИначеЕсли Тип = Перечисления.ИА_БПТипыТочекМаршрута.ВложенныйБизнесПроцесс Тогда
    КонецЕсли; 
    
    Возврат Результат;
КонецФункции

Функция   Обработчики_Получить(Объект, СобытиеОбработки) Экспорт
    Результат = Новый Структура("Событие, Код, Обработчик, ХранилищеДанных"
    , СобытиеОбработки, "", Перечисления.ИА_БПВариантыОбработчиков.ПустаяСсылка());
                                                
    ТипОбъекта = ТипЗнч(Объект);
	Если ТипОбъекта = Тип("СправочникСсылка.ИА_БПТочкиМаршрута") Тогда
        ТочкаБП = Объект;
    ИначеЕсли ИА_БФКС.РеквизитЕсть(Объект, "ИА_ТочкаБП") Тогда	
        ТочкаБП = Объект.ИА_ТочкаБП;
    КонецЕсли;
    #ЕСЛИ НЕ( Клиент или Сервер или ВнешнееСоединение ) Тогда
        ТочкаБП = Справочники.ИА_БПТочкиМаршрута.ПустаяСсылка();
    #КОНЕЦЕСЛИ
    
    НайдСтрока = ТочкаБП.Обработчики.Найти(СобытиеОбработки, "Событие");
    Если НайдСтрока <> Неопределено Тогда
        ЗаполнитьЗначенияСвойств(Результат, НайдСтрока);
    КонецЕсли; 
    Возврат Результат;
КонецФункции
 
Процедура Обработчики_Выполнить(Обработчик, Контекст, ПриОшибкеВызыватьИсключение = Истина
    , ПолеДляСохраненияРезультата = "", ПолеРезультатаЭтоОтказПроверка = Ложь
    , ИнвертироватьПолеРезультата = Ложь) Экспорт
    мен = Перечисления.ИА_БПВариантыОбработчиков;
    Если Обработчик.Обработчик = мен.ПрограммныйОбработчик Тогда
		Попытка
			УстановитьБезопасныйРежим(Истина);
        	Выполнить(Обработчик.Код);
			УстановитьБезопасныйРежим(Ложь);
        Исключение
            Ошибка = ОписаниеОшибки();
            ТекстСообщения =  "При выполнении обработчика """ + Обработчик.Событие + """ возникла ошибка!" + Символы.ПС
            + "  Описание: " + Ошибка + Символы.ПС
            + "  Контекст: " + ИА_БФКС.Струк_Представление(Контекст)  + Символы.ПС
            + "  Код обработчика: " + Обработчик.Код;
            
            СообщениеВЖурнал("ОшибкаОбработчика", ТекстСообщения);
            
            Если ПриОшибкеВызыватьИсключение Тогда
            	ВызватьИсключение ТекстСообщения;
            КонецЕсли; 
        КонецПопытки; 
    ИначеЕсли Обработчик.Обработчик = мен.КонструкторУсловия Тогда        
        Опции = Обработчик.ХранилищеДанных.Получить();
        
        Если Обработчик.Событие = Перечисления.ИА_БПСобытияТочекБП.Действие_ПриВыполнении
            ИЛИ Обработчик.Событие = Перечисления.ИА_БПСобытияТочекБП.Условие_ПроверкаУсловия
            Тогда
            
            Если Опции <> Неопределено Тогда
                СКД = Справочники.ИА_БПТочкиМаршрута.ПолучитьМакет("СКДДляОбработчиков");
                Данные = Новый Структура("СКД, Настройки, СообщениеЕслиУсловиеНеВыполнено"
                ,СКД, Неопределено, "Условие выполнения задачи не выполнено!");
                ЗаполнитьЗначенияСвойств(Данные, Опции);
                
                //{ 2015/10/13
                Если Контекст.Задача <> Неопределено И ЗначениеЗаполнено(Контекст.Задача.Ссылка) Тогда
                    ПараметрыДанных = Новый Структура("Задача, ВладелецРеквизитов"
                    , Контекст.Задача.Ссылка, Контекст.Задача.ИА_ТочкаБП.Владелец.МаршрутЗадач);
                Иначе
                    ПараметрыДанных = Новый Структура("Задача, ВладелецРеквизитов"
                    , Задачи[ПолучитьИмяЗадачи()].ПустаяСсылка(), Контекст.БП.ИА_МаршрутЗадачБП);
                КонецЕсли;
                //} 2015/10/13
                Параметры = Новый Структура("ПараметрыДанных", ПараметрыДанных);
                
                Таб = ИА_БФС.ОтборСКД_Выполнить(Данные, Параметры);
                Контекст[ПолеДляСохраненияРезультата] = Таб.Количество() = 0;
            Иначе // Если почему-то нет настроек СКД
                Контекст[ПолеДляСохраненияРезультата] = Ложь;
            КонецЕсли; 
            
        ИначеЕсли Обработчик.Событие = Перечисления.ИА_БПСобытияТочекБП.ФормированиеНаименования
            ИЛИ Обработчик.Событие = Перечисления.ИА_БПСобытияТочекБП.ФормированиеСодержания
            ИЛИ Обработчик.Событие = Перечисления.ИА_БПСобытияТочекБП.УстановкаОтветственного
            Тогда	
            Если Опции <> Неопределено Тогда
                Данные = ИА_БФС.РедакторФормул_Выполнить(Опции, Контекст);
                Контекст.Результат = Данные.Результат;
            КонецЕсли;
        КонецЕсли; 
        
        Если ИнвертироватьПолеРезультата Тогда
            Контекст[ПолеДляСохраненияРезультата] = Не Контекст[ПолеДляСохраненияРезультата];
        КонецЕсли; 
        
        Если ПолеРезультатаЭтоОтказПроверка И Контекст[ПолеДляСохраненияРезультата] Тогда
            Сообщение = Новый СообщениеПользователю;
            Сообщение.Текст = Данные.СообщениеЕслиУсловиеНеВыполнено;
            Сообщение.Сообщить(); 
        КонецЕсли; 
    КонецЕсли; 		
КонецПроцедуры

Функция   Обработчики_ПолучитьСправку(Событие) Экспорт
	мен = Перечисления.ИА_БПСобытияТочекБП;
    
    Если Событие = мен.Действие_ПриВыполнении Тогда
    	Результат = 
        "В обработчике """ + Событие + """ доступна структура ""Контекст"":
        |  - БП - ссылка на выполняемый бизнес-процесс;
        |  - Задача - ""ЗадачаОбъект"" - выполняемая задача;
        |  - Отказ  - будет передано в системную переменную ""Отказ"";
        |  - ПропуститьОбработку - выполнение данной задачи не будет никаким специальным образом обработано";
    ИначеЕсли Событие = мен.Условие_ПроверкаУсловия Тогда
    	Результат = 
        "В обработчике """ + Событие + """ доступна структура ""Контекст"":
        |  - БП - ссылка на выполняемый бизнес-процесс;
        |  - Задача - ""ЗадачаОбъект"" - задача, выполнение которой вызвало переход в блок условия;
        |  - Точка - ссылка на точку маршрута, условие которой сейчас проверяется;
        |  - Результат  - должно быть возвращено через эту переменную Истина или Ложь, соответственно для веток условия ""Да"" и ""Нет""."
        +" По умолчанию равно Неопределено и при данном значении выполнение условия не будет произведено, породившая задача останется невыполненной ";
    ИначеЕсли Событие = мен.ФормированиеНаименования ИЛИ Событие = мен.ФормированиеСодержания Тогда
    	Результат = 
        "В обработчике """ + Событие + """ доступна структура ""Контекст"":
        |  - БП - ссылка на выполняемый бизнес-процесс;
        |  - Задача - задача-объект: текущая создаваемая задача;
        |  - ТабРеквизиты - содержит доп.реквизиты: массив структур с полями ""Реквизит"" и ""Значение"";
        |  - Результат  - должна быть возвращена строка";
    ИначеЕсли Событие = мен.УстановкаОтветственного Тогда
    	Результат = 
        "В обработчике """ + Событие + """ доступна структура ""Контекст"":
        |  - БП - ссылка на выполняемый бизнес-процесс;
        |  - Задача - задача-объект: текущая создаваемая задача;
        |  - ТабРеквизиты - содержит доп.реквизиты: массив структур с полями ""Реквизит"" и ""Значение"";
        |  - Результат  - возвращаемое значение";
    Иначе
        Результат = "<<Справки нет!!!>>";
    КонецЕсли; 
    
    Возврат Результат;
КонецФункции

//_____________________________________________________________
// Обработчики форм

Процедура ФормаЗадачи_ЗаполнитьРеквизитыБП(ОбъектЗадача, ТабБПРеквизиты) Экспорт
	#ЕСЛИ НЕ( Клиент или Сервер или ВнешнееСоединение ) Тогда
        ОбъектЗадача = Задачи.ИА_БПЗадачаНосителя.СоздатьЗадачу();
    #КОНЕЦЕСЛИ
    
    ТабБПРеквизиты.Очистить();
    Если ЗначениеЗаполнено(ОбъектЗадача.БизнесПроцесс)
        И ЗначениеЗаполнено(ОбъектЗадача.ИА_ТочкаБП)
        И ОбъектЗадача.ИА_ТочкаБП.ВыводимыеРеквизиты.Количество() > 0
        Тогда
    	Для каждого Стр Из ОбъектЗадача.ИА_ТочкаБП.ВыводимыеРеквизиты Цикл
        	НовСтрока = ТабБПРеквизиты.Добавить();
            ЗаполнитьЗначенияСвойств(НовСтрока, Стр);
            
            НайдСтрока = ОбъектЗадача.БизнесПроцесс.ИА_Реквизиты.Найти(НовСтрока.Реквизит, "Реквизит");
            Если НайдСтрока = Неопределено Тогда
            	НовСтрока.Значение = НовСтрока.Реквизит.ТипЗначения.ПривестиЗначение(Неопределено);
            Иначе
                НовСтрока.Значение = НайдСтрока.Значение;
            КонецЕсли; 
        КонецЦикла;
    КонецЕсли; 
    
КонецПроцедуры
 
Процедура ФормаЗадачи_ЗаписатьСвязанныеДанныеБП(ОбъектЗадача, ТабБПРеквизиты) Экспорт
	#ЕСЛИ НЕ( Клиент или Сервер или ВнешнееСоединение ) Тогда
        ОбъектЗадача = Задачи.ИА_БПЗадачаНосителя.СоздатьЗадачу();
    #КОНЕЦЕСЛИ
     
	Если ТабБПРеквизиты.Количество() > 0 Тогда
    	БП = ОбъектЗадача.БизнесПроцесс.ПолучитьОбъект();
        Для каждого Стр Из ТабБПРеквизиты Цикл
        	НайдСтрока = БП.ИА_Реквизиты.Найти(Стр.Реквизит, "Реквизит");
            Если НайдСтрока = Неопределено Тогда
                НайдСтрока = БП.ИА_Реквизиты.Добавить();
            	НайдСтрока.Реквизит = Стр.Реквизит;
            КонецЕсли; 
            НайдСтрока.Значение = Стр.Значение;
        КонецЦикла;  
        БП.Записать();
    КонецЕсли;     
КонецПроцедуры
 
//_____________________________________________________________
// Подписки на события

Процедура ИА_БФБППриВыполненииЗадачПриВыполнении(Источник, Отказ) Экспорт
    #ЕСЛИ НЕ( Клиент или Сервер или ВнешнееСоединение ) Тогда
        Источник = Задачи.ИА_БПЗадачаНосителя.СоздатьЗадачу();
    #КОНЕЦЕСЛИ
     
	Если ИА_БФКС.РеквизитЕсть(Источник, "БизнесПроцесс")
		И ЗначениеЗаполнено(Источник.БизнесПроцесс)
        И ПравоДоступа("Изменение",Метаданные.БизнесПроцессы.ИА_БПНоситель)
        И ИА_БФКС.РеквизитЕсть(Источник, "ИА_ТочкаБП")
        И ИА_БФКС.РеквизитЕсть(Источник.БизнесПроцесс, "ИА_КартаМаршрутаБП")
        И ЗначениеЗаполнено(Источник.БизнесПроцесс.ИА_КартаМаршрутаБП)
        Тогда
        
        Если НЕ ИА_Защита_Общий.ЛицензияДоступна("НФ", Отказ) Тогда Возврат КонецЕсли; 
        
        ТочкаБП = Источник.ИА_ТочкаБП;
        менТипы = Перечисления.ИА_БПТипыТочекМаршрута;
        
        ПропуститьОбработку = Источник.ИА_ИсключенаИзОбработки;
        Контекст = Новый Структура("Задача, БП, Отказ, ПропуститьОбработку"
        , Источник, Источник.БизнесПроцесс, Отказ, ПропуститьОбработку); 
        ИА_БПСПереопределяемый.Задачи_ПередВыполнением(Контекст);
        
        //{ Обработка влож. БП
        ПрограммноеЗавершение = Ложь;
        Если Источник.ДополнительныеСвойства.Свойство("ИА_ПрограммноеЗавершение") Тогда
        	ПрограммноеЗавершение = Источник.ДополнительныеСвойства.ИА_ПрограммноеЗавершение;
        КонецЕсли; 
        
        Если Источник.ИА_ТочкаБП.Тип = менТипы.ВложенныйБизнесПроцесс
            И НЕ ПрограммноеЗавершение
            Тогда
            
            Список = ПолучитьСписокПодчиненныхБП(Источник.Ссылка, Истина);
            
            ИА_БФКС.СообщениеОбОшибке(ИА_БФКС.Стр_ПодставитьПараметрыВСтроку(
            "Задача ""%1"" завершится автоматически при выполнении подчиненного бизнес-процесса ""%2"" !"
            ,Источник.Ссылка, ИА_БФКС.Массив_Представление(Список))
            ,  Контекст.Отказ); 
        КонецЕсли; 
        //}
        
        Если Контекст.ПропуститьОбработку ИЛИ Контекст.Отказ Тогда
            Отказ = Контекст.Отказ;
        	Возврат
        КонецЕсли; 
        
        СписокКонтролируемыхРеквизитов = ИА_БФС.ТЗ_ФильтрПоОтбору(ТочкаБП.ВыводимыеРеквизиты
        , Новый Структура("КонтролироватьЗаполнение", Истина)).ВыгрузитьКолонку("Реквизит");
        Если СписокКонтролируемыхРеквизитов.Количество() > 0 Тогда
            ТабРеквизиты = БизнесПроцессы.ИА_БПНоситель.ПолучитьРеквизиты(Источник.БизнесПроцесс
            , СписокКонтролируемыхРеквизитов); 
            ТекстОшибки = "";
            Для каждого Стр Из ТабРеквизиты Цикл
            	Если НЕ ЗначениеЗаполнено(Стр.Значение) Тогда
                	ТекстОшибки = ТекстОшибки + Символы.ПС + " — " + Стр.Реквизит;
                КонецЕсли; 
            КонецЦикла;  
            Если ЗначениеЗаполнено(ТекстОшибки) Тогда
            	ТекстОшибки = "Не заполнены реквизиты бизнес-процесса:" + ТекстОшибки;
                ИА_БФКС.СообщениеОбОшибке(ТекстОшибки, Контекст.Отказ); 
            КонецЕсли; 
            
            Если Контекст.ПропуститьОбработку ИЛИ Контекст.Отказ Тогда
                Отказ = Контекст.Отказ;
                Возврат
            КонецЕсли; 
        КонецЕсли; 
        
        
        Если ТочкаБП.Тип = менТипы.Действие Тогда
            Обработчик = Обработчики_Получить(Источник, Перечисления.ИА_БПСобытияТочекБП.Действие_ПриВыполнении);
            Обработчики_Выполнить(Обработчик, Контекст,,"Отказ", Истина);
        КонецЕсли; 
        
        Если Контекст.ПропуститьОбработку ИЛИ Контекст.Отказ Тогда
            Отказ = Контекст.Отказ;
            Возврат
        КонецЕсли; 
        
        
        // Наш клиент!
        БП = Источник.БизнесПроцесс;
        Точка = Источник.ИА_ТочкаБП;
        
        Если НЕ ЗначениеЗаполнено(Точка) Тогда
            Сообщение = Новый СообщениеПользователю;
            Сообщение.Текст = "Данные задачи выполняются автоматически ! " + Источник;
            Сообщение.Сообщить(); 
            Отказ = Истина;
        ИначеЕсли Точка.Тип = менТипы.Условие
            И НЕ ЗначениеЗаполнено(Источник.ИА_ВариантУсловияБП)
            Тогда
            Сообщение = Новый СообщениеПользователю;
            Сообщение.Текст = "Не указан вариант условия в задаче! " + Источник;
            Сообщение.Сообщить(); 
            Отказ = Истина;
        Иначе
            // Надо создать следующие задачи!
            Источник.ИА_БПДатаЗавершения = ТекущаяДата();
            
            Обр = Обработки.ИА_БПМенеджер.Создать();
            Обр.Инициализировать(Источник.БизнесПроцесс);
            Обр.Задачи_Выполнить(Источник, Отказ);
        КонецЕсли; 
    КонецЕсли; 
КонецПроцедуры

Процедура ИА_БФБППередЗаписьюБППередЗаписью(Источник, Отказ) Экспорт
	#ЕСЛИ НЕ( Клиент или Сервер или ВнешнееСоединение ) Тогда
	    Источник = БизнесПроцессы.ИА_БПНоситель.СоздатьБизнесПроцесс();
	#КОНЕЦЕСЛИ
	
	Если Источник.ОбменДанными.Загрузка Тогда Возврат КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Источник.ИА_БПДатаЗавершения)
		И Источник.Завершен И Источник.Завершен <> Источник.Ссылка.Завершен
		Тогда // Теперь он завершен
		Источник.ИА_БПДатаЗавершения = ТекущаяДата();
	КонецЕсли;  
	
	Если НЕ Источник.Завершен Тогда
		Источник.ИА_БПДатаЗавершения = Неопределено;
	КонецЕсли; 
	
	Если НЕ ЗначениеЗаполнено(Источник.ИА_Ответственный) Тогда
		Источник.ИА_Ответственный = ИА_БПСПереопределяемый.ТекущийПользователь();
	КонецЕсли;
КонецПроцедуры
